Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ДокументыТребующиеПерепроведенияСУО/ДокументыТребующиеПерепроведенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыТребующиеПерепроведенияСУО</name>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗаписиДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьПодчиненныеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПовтора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПрохожденияОбученияСУО/ПрохожденияОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрохожденияОбученияСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрещеноОбщениеМеждуУчастниками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/УчастникиОбученияСУО/УчастникиОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеМероприятия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОтсчетаПродолжительности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПродолжительности</name>
    <type>
      <types>EnumRef.ПродолжительностьОбученияСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФайлыНаПроверкуПреподавателюСУО/ФайлыНаПроверкуПреподавателюСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФайлыНаПроверкуПреподавателюСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Учащийся</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеПреподавателемОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ПрохождениеОбученияСУОПрисоединенныеФайлы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ПродолжительностьОбученияСУО/ПродолжительностьОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПродолжительностьОбученияСУО</name>
  <enumValues>
    <name>Фиксированная</name>
  </enumValues>
  <enumValues>
    <name>СНачалаОбучения</name>
  </enumValues>
  <enumValues>
    <name>СЗачисления</name>
  </enumValues>
  <enumValues>
    <name>НеЗадана</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

Перем ДанныеПроведенияОбучения;
	
#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	// Делаем проверки возможности записи документа
	
	Если Ссылка.Пустая() Тогда

		ПрохождениеОбучения = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ПроведениеОбучения, Сценарий, Пользователь);
		
		Если ЗначениеЗаполнено(ПрохождениеОбучения) Тогда
			Текст = НСтр("ru = 'Пользователь ""%1"" уже зачислен на обучение ""%2"" (""%3"")'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Пользователь, Сценарий, ПрохождениеОбучения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеПроведенияОбучения = УправлениеОбучениемСУОПовтИсп.ДанныеМероприятия(ПроведениеОбучения,
		"Ссылка,
		|БезСценария,
		|НаОсновеМероприятия,
		|НаОсновеЭлектронногоРесурса,
		|Мероприятие,
		|ЭлектронныйРесурс,
		|Наименование,
		|ВидОбучения,
		|ЗапретитьОбщениеМеждуУчастниками,
		|Статус,
		|ЦветЗапланированногоМероприятияНаКалендареУчащегося,
		|ЦветАктивногоМероприятияНаКалендареУчащегося,
		|ЦветЗавершенногоМероприятияНаКалендареУчащегося,
		|ЦветОтмененногоМероприятияНаКалендареУчащегося,
		|МестоПроведения,
		|ДатаНачалаПроведения,
		|ДатаОкончанияПроведения,
		|ДатаНачалаДоступа,
		|ДатаКонтроля,
		|ПродолжительностьВСекундах,
		|ВариантПродолжительности,
		|КачествоОбученияОцениваетсяУчастниками");

	
	ВидОбучения = ПолучитьВидОбучения();
	СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ЭтотОбъект, ДанныеПроведенияОбучения.Статус);		
	ПродолжительностьПроведения = Документы.ПроведениеОбученияСУО.Продолжительность(ПроведениеОбучения);
	
	Если ВидОбучения.Электронное Тогда
		
		ДатыНеПоказывать = СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен
				ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом;
				
		Если ДатыНеПоказывать Тогда
			
			ДатаНачалаПрохождения = Неопределено;
			ДатаОкончанияПрохождения = Неопределено;
			
		Иначе
									
			ПоказыватьРасчетнуюДатуНачала = ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
				И (СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Новое
					ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Запланировано);
								
			Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Активно
				ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Проверяется
				ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.ВозвращеноНаДоработку Тогда
				
				ПоказыватьРасчетнуюДатуОкончания = Истина;
				
			ИначеЕсли (ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная
				ИЛИ ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления)
				И (СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Новое
				ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.Запланировано) Тогда
				
				ПоказыватьРасчетнуюДатуОкончания = Истина;
				
			Иначе
				
				ПоказыватьРасчетнуюДатуОкончания = Ложь;
				
			КонецЕсли;
			
			Если ПоказыватьРасчетнуюДатуНачала Тогда
				ДатаНачалаПрохождения = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Сценарий);
			Иначе
				ДатаНачалаПрохождения = ?(ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.СЗачисления,
					Дата, ДатаНачалаОбучения);
			КонецЕсли;
			
			
			Если ПоказыватьРасчетнуюДатуОкончания Тогда
				
				Если ДанныеПроведенияОбучения.ВариантПродолжительности = Перечисления.ПродолжительностьОбученияСУО.Фиксированная Тогда
					ДатаОкончанияПроведения = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, Сценарий);
					Если ЗначениеЗаполнено(ДатаОкончанияПроведения) Тогда
						ДатаОкончанияПрохождения = ДатаОкончанияПроведения + ДобавленоВремениВСекундах;
					Иначе
						ДатаОкончанияПрохождения = ДатаОкончанияОбучения;
					КонецЕсли;
				ИначеЕсли ПродолжительностьПроведения > 0 И ЗначениеЗаполнено(ДатаНачалаПрохождения) Тогда
					ДатаОкончанияПрохождения = ДатаНачалаПрохождения + ПродолжительностьПроведения + ДобавленоВремениВСекундах;
				КонецЕсли;
				
			Иначе			
				
				Если СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеДопущен
					ИЛИ СтатусПроцессаОбучения = Перечисления.СтатусыПроцессаОбученияСУО.НеОкончено Тогда
					
					ДатаОкончанияПрохождения = Дата("00010101");
					
				Иначе
					
					ДатаОкончанияПрохождения = ДатаОкончанияОбучения;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;				
			
	Иначе
		
		ДатаНачалаПрохождения = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Сценарий);
		ДатаОкончанияПрохождения = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, Сценарий);		
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаПрохождения) И ЗначениеЗаполнено(ДатаОкончанияПрохождения)
		И ДатаНачалаПрохождения > ДатаОкончанияПрохождения Тогда
		
		// Дата начала обучения может быть позже окончания, если изменялись даты обучения
		// после начала обучения участников.
		ДатаОкончанияПрохождения = ДатаНачалаПрохождения;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаПрохождения) И ЗначениеЗаполнено(ДатаОкончанияПрохождения) Тогда
		ПродолжительностьВСекундах = ДатаОкончанияПрохождения - ДатаНачалаПрохождения;	
	Иначе
		ПродолжительностьВСекундах = ПродолжительностьПроведения + ДобавленоВремениВСекундах;
	КонецЕсли;	
	
	Если НЕ ДополнительныеСвойства.Свойство("ПриПрохожденииОбучения")
		ИЛИ НЕ ДополнительныеСвойства.ПриПрохожденииОбучения Тогда
		
		// Если это проведение при прохождении обучения, то реквизит ВыставляетсяОценка уже заполнен.
		
		Задания = Документы.ПроведениеОбученияСУО.ЗаданияОбучения(ПроведениеОбучения, Сценарий,,ВидОбучения);
		Электронное = Документы.ПроведениеОбученияСУО.ЭтоЭлектронноеОбучение(ПроведениеОбучения, ВидОбучения, Сценарий);
		ЭлектронныйРесурс = Документы.ПроведениеОбученияСУО.ЭлектронныйРесурсОбучения(ДанныеПроведенияОбучения, Сценарий, Электронное);
				
		ВыставляетсяОценка = Документы.ПрохождениеОбученияСУО.ВыставляетсяОценка(Ссылка, ВидОбучения, ЭлектронныйРесурс, Задания, Статус); 
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Отменено И ПометкаУдаления Тогда
		// Прохождение обучения не может быть одновременно
		// отмененным и помеченным на удаление.
		Отменено = Ложь;
	КонецЕсли;	
	
	Если НЕ Отменено И НЕ ЭтоНовый() Тогда
		ДанныеСуществующегоПрохождения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Отменено, ПометкаУдаления");		
		Если ДанныеСуществующегоПрохождения.Отменено Тогда
			СуществующееПрохождение = Документы.ПроведениеОбученияСУО.ПрохождениеОбучения(ПроведениеОбучения, Сценарий, Пользователь);			
			Если ЗначениеЗаполнено(СуществующееПрохождение) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для восстановления обучения необходимо отменить все существующие обучения участника'"),,,,Отказ);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ПометкаУдаления И ДанныеСуществующегоПрохождения.ПометкаУдаления И РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
			РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокумент(Ссылка, РежимЗаписиДокумента.Проведение, Ложь, 0, 3);
		КонецЕсли;
	КонецЕсли;
	
	Если ВыставляетсяОценка 
		И Баллы > 0
		И (Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Автомат
		ИЛИ Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил) Тогда
		
		ВыставленаОценка = Истина;
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("СоздатьАвтоматическуюРассылку", Ложь);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И НЕ Проведен Тогда
		ДополнительныеСвойства.СоздатьАвтоматическуюРассылку = Истина;	
	КонецЕсли;
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	/////////////////////////////////////////////////////////////////////////////
	// Движения
	
	Движения.ПрохожденияОбученияСУО.Записывать             = Истина;
	Движения.УчастникиОбученияСУО.Записывать               = Истина;
	Движения.РасписаниеОбученияСУО.Записывать              = Истина;
	
	Движения.БиблиотекаПользователейСУО.Записывать         = Истина;
	Движения.ФайлыНаПроверкуПреподавателюСУО.Записывать    = Истина;
	Движения.ОценкиКачестваОбученияСУО.Записывать          = Истина;
	
	СтатусПроцессаОбучения = Документы.ПрохождениеОбученияСУО.СтатусПроцессаОбучения(ЭтотОбъект);
	ПрохождениеОтменено    = Документы.ПрохождениеОбученияСУО.Отменено(ЭтотОбъект);
	ПрохождениеАктуально   = Документы.ПрохождениеОбученияСУО.Актуально(Ссылка, СтатусПроцессаОбучения);	
	
	Если НЕ ПрохождениеОтменено Тогда
		
		ВидОбучения = ПолучитьВидОбучения();
		СценарийОбучения = Документы.ПрохождениеОбученияСУО.СценарийОбучения(ЭтотОбъект);
		ШкалаОценки = Документы.ПроведениеОбученияСУО.ШкалаОценки(ДанныеПроведенияОбучения);
		ДистанционноеОбучение = Документы.ПроведениеОбученияСУО.ДистанционноеОбучение(ДанныеПроведенияОбучения, СценарийОбучения);
		
		Если ДанныеПроведенияОбучения.НаОсновеМероприятия Тогда
			Значимость = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеПроведенияОбучения.Мероприятие, "Значимость");
		Иначе
			Значимость = 0;
		КонецЕсли;
		
		// ПрохожденияОбученияСУО
		
		// Регистр позволяет узнать, какие пользователи какие мероприятия проходили.
		
		Если НЕ ЗначениеЗаполнено(РодительскоеПрохождение) Тогда
			
			Движение = Движения.ПрохожденияОбученияСУО.Добавить();
			
			Движение.Период                           = Дата;
			Движение.Пользователь                     = Пользователь;
			Движение.Сценарий                         = СценарийОбучения;
			Движение.Баллы                            = Баллы;
			Движение.ТекущиеБаллы                     = ТекущиеБаллы;
			Движение.ЗавершеноВПроцентах              = ЗавершеноВПроцентах;
			Движение.Вид                              = ВидОбучения;
			Движение.Актуально                        = ПрохождениеАктуально;
			Движение.Статус                           = Статус;
			Движение.СтатусПроцессаОбучения           = СтатусПроцессаОбучения;
			Движение.УчебнаяГруппа                    = УчебнаяГруппа;
			Движение.ПроведениеОбучения               = ПроведениеОбучения;
			Движение.РодительскоеПрохождение          = РодительскоеПрохождение;
			Движение.ДатаНачалаПрохождения            = ДатаНачалаПрохождения;
			Движение.ДатаОкончанияПрохождения         = ДатаОкончанияПрохождения;
			Движение.Значимость                       = Значимость;
			Движение.ШкалаОценки                      = ШкалаОценки;
			Движение.ПрохождениеПрограммыОбучения     = ПрохождениеПрограммыОбучения;
			Движение.ЗапрещеноОбщениеМеждуУчастниками = ДанныеПроведенияОбучения.ЗапретитьОбщениеМеждуУчастниками;
			Движение.НаОсновеЭлектронногоРесурса      = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			Движение.НаОсновеМероприятия              = ДанныеПроведенияОбучения.НаОсновеМероприятия;
			Движение.ДатаПоследнейАктивности          = ДатаПоследнейАктивности;
			Движение.ВыставляетсяОценка               = ВыставляетсяОценка;
			
			Если ЗначениеЗаполнено(Движение.ДатаОкончанияПрохождения) Тогда
				Движение.ПродолжительностьВСекундах = Движение.ДатаОкончанияПрохождения - Движение.ДатаНачалаПрохождения;
			КонецЕсли;
			
			Движение.ДобавленоВремениВСекундах = ДобавленоВремениВСекундах;
			
		КонецЕсли;
			
		// УчастникиОбученияСУО
		
		// Регистр позволяет получить участников мероприятий,
		// в т.ч. и подчиненных (для каждого подчиненного сценария 
		// создается запись в этом регистре).
		
		Движение = Движения.УчастникиОбученияСУО.Добавить();
		
		Движение.ПроведениеОбучения           = ПроведениеОбучения;
		Движение.Пользователь                 = Пользователь;
		Движение.Сценарий                     = СценарийОбучения;
		Движение.Статус                       = Статус;
		Движение.Баллы                        = Баллы;
		Движение.ТекущиеБаллы                 = ТекущиеБаллы;
		Движение.ЗавершеноВПроцентах          = ЗавершеноВПроцентах;
		Движение.Статус                       = Статус;
		Движение.СтатусПроцессаОбучения       = СтатусПроцессаОбучения;
		Движение.УчебнаяГруппа                = УчебнаяГруппа;
		Движение.ШкалаОценки                  = ШкалаОценки;
		Движение.ПрохождениеПрограммыОбучения = ПрохождениеПрограммыОбучения;
		Движение.ДатаНачалаПрохождения        = ДатаНачалаПрохождения;
		Движение.ДатаОкончанияПрохождения     = ДатаОкончанияПрохождения;
		Движение.КомментарийПреподавателя     = КомментарийПреподавателя;
		Движение.МестоПроведения              = ?(ДистанционноеОбучение, Перечисления.МестаПроведенияМероприятийСУО.Дистанционно, Перечисления.МестаПроведенияМероприятийСУО.Аудитория);
		Движение.ПродолжительностьВСекундах   = ПродолжительностьВСекундах;
		Движение.ДатаКонтроля                 = ДанныеПроведенияОбучения.ДатаКонтроля;
		Движение.Электронное                  = ВидОбучения.Электронное;
		Движение.ТребуетсяПреподаватель       = ВидОбучения.ТребуетсяПреподаватель;
		Движение.Общее                        = ВидОбучения.Общее;
		Движение.ВыставляетсяОценка           = ВыставляетсяОценка;
		Движение.НаОсновеЭлектронногоРесурса  = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
		Движение.НаОсновеМероприятия          = ДанныеПроведенияОбучения.НаОсновеМероприятия;
		Движение.ПроверяетсяПреподавателем    = ПроверяетсяПреподавателем;
		Движение.ПроверенПреподавателем       = ПроверенПреподавателем;
		Движение.Вид                          = ВидОбучения;
		Движение.ВозвращеноНаДоработку        = ВозвращеноНаДоработку;
		
		ДанныеДляПолученияНачалаОтсчета = Новый Структура(
			"ВариантПродолжительности,
			|ДатаЗачисления,
			|ДатаНачалаПрохождения",
			ДанныеПроведенияОбучения.ВариантПродолжительности,
			Дата,
			ДатаНачалаПрохождения);
			
		Движение.ДатаНачалаОтсчетаПродолжительности = Документы.ПрохождениеОбученияСУО.ДатаНачалаОтсчетаПродолжительности(ДанныеДляПолученияНачалаОтсчета);
		Движение.ВариантПродолжительности = ДанныеПроведенияОбучения.ВариантПродолжительности;
				
		// РасписаниеОбученияСУО
		
		// Регистр позволяет узнать те мероприятия, которые пользователь
		// увидит в своем расписании.
		
		Если НЕ ВидОбучения.Общее Тогда
			
			Движение = Движения.РасписаниеОбученияСУО.Добавить();
			
			Движение.Сценарий                 = СценарийОбучения;
			Движение.Вид                      = ВидОбучения;
			Движение.Пользователь             = Пользователь;
			Движение.ПроведениеОбучения       = ПроведениеОбучения;
			Движение.СтатусПроведения         = ДанныеПроведенияОбучения.Статус;
			
			
			Движение.ДатаНачалаПроведения     = Документы.ПроведениеОбученияСУО.ДатаНачалаПроведения(ПроведениеОбучения, Сценарий);
			Движение.ДатаОкончанияПроведения  = Документы.ПроведениеОбученияСУО.ДатаОкончанияПроведения(ПроведениеОбучения, Сценарий);
			Движение.ДатаНачалаПрохождения    = ДатаНачалаПрохождения;
			Движение.ДатаОкончанияПрохождения = ДатаОкончанияПрохождения;
			
			Движение.Статус                   = Статус;
			Движение.СтатусПроцессаОбучения   = СтатусПроцессаОбучения;
			Движение.Актуально                = ПрохождениеАктуально;
			Движение.Баллы                    = Баллы;
			Движение.ТекущиеБаллы             = ТекущиеБаллы;
			Движение.ЗавершеноВПроцентах      = ЗавершеноВПроцентах;
			Движение.УчебнаяГруппа            = УчебнаяГруппа;
			Движение.ШкалаОценки              = ШкалаОценки;
			Движение.ВыставляетсяОценка       = ВыставляетсяОценка;
			
			Если ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса Тогда
				
				Движение.МероприятиеСОднимЭлектроннымЗаданием = Истина;
				
			ИначеЕсли ДанныеПроведенияОбучения.НаОсновеМероприятия Тогда
				
				ОписаниеМероприятияСОднимЭлектроннымЗаданием = УправлениеОбучениемСУОПовтИсп.ОписаниеЕдинственногоЗаданияСценария(ДанныеПроведенияОбучения.Мероприятие, ПроведениеОбучения);
				
				Если ОписаниеМероприятияСОднимЭлектроннымЗаданием = Неопределено Тогда
					Движение.МероприятиеСОднимЭлектроннымЗаданием = Ложь;
				Иначе
					Движение.МероприятиеСОднимЭлектроннымЗаданием = Истина;
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(ДанныеПроведенияОбучения.ЭлектронныйРесурс) Тогда
				
				Движение.МероприятиеСОднимЭлектроннымЗаданием = Истина;
				
			Иначе				
				
				Движение.МероприятиеСОднимЭлектроннымЗаданием = Ложь;
				
			КонецЕсли;
				
			Движение.ПрохождениеПрограммыОбучения = ПрохождениеПрограммыОбучения;
			Движение.НаОсновеЭлектронногоРесурса  = ДанныеПроведенияОбучения.НаОсновеЭлектронногоРесурса;
			Движение.ДатаКонтроля                 = ДанныеПроведенияОбучения.ДатаКонтроля;			
			Движение.ЦветНаКалендаре              = Документы.ПроведениеОбученияСУО.ЦветНаКалендаре(
				ДанныеПроведенияОбучения, ВидОбучения, Перечисления.ТипыУчебныхАктивностейСУО.Обучение);
		
		КонецЕсли;
		
		// Библиотека пользователя

		ВыборкаРесурсовДляБиблиотеки = УправлениеОбучениемСУОПовтИсп.ВыборкаДанныхДляЗаполненияБиблиотекиПользователя(Сценарий, ПроведениеОбучения);
		
		МероприятиеПройдено = ?(Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.Завершил ИЛИ Статус = Перечисления.СтатусыПрохожденияОбъектовСУО.НеЗавершил, Истина, Ложь);
				
		РегистрыСведений.БиблиотекаПользователейСУО.БиблиотекаПользователейЗаполнитьДвижения(Движения, Пользователь, Дата, ВыборкаРесурсовДляБиблиотеки, СтатусПроцессаОбучения, ДанныеПроведенияОбучения.Статус, Истина);
		
		// Файлы на проверку преподавателю
		
		ПрикрепленныеФайлы = ОбучениеСУО.ПрикрепленныеФайлыКОбъектуОбучения(Ссылка).ВыгрузитьКолонку("Ссылка");
		
		Если ПрикрепленныеФайлы.Количество() > 0 Тогда
			
			ПреподавателиОбучения = Документы.ПроведениеОбученияСУО.Преподаватели(ПроведениеОбучения, Сценарий, Ложь);
			
			Для каждого Строка Из ПреподавателиОбучения Цикл
				
				Для каждого Файл Из ПрикрепленныеФайлы Цикл

					Движение = Движения.ФайлыНаПроверкуПреподавателюСУО.Добавить();
					
					Движение.Файл          = Файл;
					Движение.Преподаватель = Строка.Преподаватель;
					Движение.Учащийся      = Пользователь;
					Движение.ПроведениеПреподавателемОбучения = Строка.ПроведениеПреподавателемОбучения;
				
				КонецЦикла;
						
			КонецЦикла;
			
		КонецЕсли;
		
		// Примечание: движения по регистру ФайлыНаПроверкуПреподавателюСУО
		// при назначении новых преподавателей будут обновлены при
		// перепроведении документа ПроведениеОбученияСУО,
		// которое инициализируется при назначении преподавателей в функции
		// УправлениеОбучениемСУО.НазначитьПреподавателяНаОбучение.
		
		// Оценки качества обучения
		
		ДоступенБлокОцениванияКачестваОбучения = Документы.ПрохождениеОбученияСУО.ДоступенБлокОцениванияКачестваОбучения(
				СтатусПроцессаОбучения, ДанныеПроведенияОбучения.КачествоОбученияОцениваетсяУчастниками);
		
		Если ДоступенБлокОцениванияКачестваОбучения ИЛИ ЗначениеЗаполнено(ОценкаКачестваОбучения) Тогда
			
			Движение = Движения.ОценкиКачестваОбученияСУО.Добавить();
			
			Движение.ПроведениеОбучения = ПроведениеОбучения;
			Движение.Участник = Пользователь;
			Движение.Оценка = ОценкаКачестваОбучения;
			Движение.ДатаВыставления = ДатаОцениванияКачестваОбучения;
			Движение.Комментарий = КомментарийКачестваОбучения;						
			Движение.Выставлена = ЗначениеЗаполнено(ОценкаКачестваОбучения);
			
		КонецЕсли;
		
	КонецЕсли; // НЕ Отменено
	
	Движения.Записать(); // Записываем движения
	
	// Создаем авто-раздел форума, если он доступен пользователю

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТемыПользователейСУО.Тема
		|ИЗ
		|	РегистрСведений.ТемыПользователейСУО КАК ТемыПользователейСУО
		|ГДЕ
		|	ТемыПользователейСУО.Пользователь = &Пользователь
		|	И ТемыПользователейСУО.Контекст = &ПроведениеОбучения";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Примечание: авто раздел доступен, если есть хотя бы одна тема
	// И обучение актуально.
	
	Если НЕ РезультатЗапроса.Пустой() И ПрохождениеАктуально Тогда
		РегистрыСведений.АвтоРазделыФорумаСУО.ДобавитьАвтоРаздел(Пользователь, ПроведениеОбучения, Документы.СообщениеСУО.ПредставлениеГрупповогоОбсуждения(ПроведениеОбучения));			
	Иначе
		РегистрыСведений.АвтоРазделыФорумаСУО.УдалитьАвтоРаздел(Пользователь, ПроведениеОбучения);
	КонецЕсли;
	
	// Создание рассылки
		
	Если НЕ ПрохождениеОтменено
		И ДополнительныеСвойства.Свойство("СоздатьАвтоматическуюРассылку")
		И ДополнительныеСвойства.СоздатьАвтоматическуюРассылку Тогда
				
		УправлениеОбучениемСУО.СоздатьАвтоматическуюРассылку(ЭтотОбъект);

	КонецЕсли;
	
	// Перепроводим подчиненные документы	
		
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбновитьПодчиненныеДокументы(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ОбновитьПодчиненныеДокументы(РежимЗаписи)
	
	Если НЕ УправлениеОбучениемСУО.МожноОбновлятьПодчиненныеДокументы(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеОбученияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрохождениеОбученияСУО КАК ПрохождениеОбученияСУО
		|ГДЕ
		|	ПрохождениеОбученияСУО.ПроведениеОбучения = &ПроведениеОбучения
		|	И ПрохождениеОбученияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПрохождениеОбученияСУО.РодительскоеПрохождение = &РодительскоеПрохождение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПопыткаВыполненияЗаданияСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПопыткаВыполненияЗаданияСУО КАК ПопыткаВыполненияЗаданияСУО
		|ГДЕ
		|	ПопыткаВыполненияЗаданияСУО.ПометкаУдаления = ЛОЖЬ
		|	И ПопыткаВыполненияЗаданияСУО.ПрохождениеОбучения = &ПрохождениеОбучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеСУО КАК СообщениеСУО
		|		ПО (СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка)
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст = &ПрохождениеОбучения
		|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
		|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
		|	И СообщениеСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СообщениеСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СообщениеСУО КАК СообщениеСУО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТемыСообщенийСУО КАК ТемыСообщенийСУО
		|		ПО СообщениеСУО.Тема = ТемыСообщенийСУО.Ссылка
		|ГДЕ
		|	ТемыСообщенийСУО.Контекст = &ПроведениеОбучения
		|	И СообщениеСУО.ПервоеСообщениеВТеме = ИСТИНА
		|	И СообщениеСУО.ПометкаУдаления = ЛОЖЬ
		|	И СообщениеСУО.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПроведениеОбученияСУО.УсловияЗачисленияУчастников КАК ПроведениеОбученияСУОУсловияЗачисленияУчастников
		|ГДЕ
		|	(ПроведениеОбученияСУОУсловияЗачисленияУчастников.Сценарий = &Сценарий
		|			ИЛИ ПроведениеОбученияСУОУсловияЗачисленияУчастников.Сценарий = &ПроведениеОбучения)
		|	И ПроведениеОбученияСУОУсловияЗачисленияУчастников.Статус = &Статус
		|	И ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка.АвтозачислениеНаОбучение = ИСТИНА
		|	И ПроведениеОбученияСУОУсловияЗачисленияУчастников.Ссылка <> &ПроведениеОбучения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СертификатСУО.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СертификатСУО КАК СертификатСУО
		|ГДЕ
		|	СертификатСУО.ПометкаУдаления = ЛОЖЬ
		|	И СертификатСУО.ПрохождениеОбучения = &ПрохождениеОбучения";
	
	Запрос.УстановитьПараметр("ПроведениеОбучения", ПроведениеОбучения);
	Запрос.УстановитьПараметр("ПрохождениеОбучения", Ссылка);
	Запрос.УстановитьПараметр("РодительскоеПрохождение", Ссылка);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	Запрос.УстановитьПараметр("Статус", Статус);

	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Для каждого Результат Из МассивРезультатов Цикл
	
		ВыборкаДетальныеЗаписи = Результат.Выбрать();
		
		РегистрыСведений.ДокументыТребующиеПерепроведенияСУО.ДобавитьДокументы(ВыборкаДетальныеЗаписи, РежимЗаписи,,3);
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьВидОбучения()
	
	Если ДанныеПроведенияОбучения.БезСценария Тогда
		Возврат ДанныеПроведенияОбучения.ВидОбучения;
	Иначе
		Возврат Документы.ПроведениеОбученияСУО.ВидОбучения(ПроведениеОбучения);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти	

#КонецЕсли
